{"config": {"output_layers": [["decoder_dense", 0, 0]], "name": "model_1", "input_layers": [["encoder_inputs", 0, 0], ["decoder_inputs", 0, 0]], "layers": [{"inbound_nodes": [], "class_name": "InputLayer", "config": {"batch_input_shape": [null, null, 45], "sparse": false, "name": "encoder_inputs", "dtype": "float32"}, "name": "encoder_inputs"}, {"inbound_nodes": [], "class_name": "InputLayer", "config": {"batch_input_shape": [null, null, 45], "sparse": false, "name": "decoder_inputs", "dtype": "float32"}, "name": "decoder_inputs"}, {"inbound_nodes": [[["encoder_inputs", 0, 0, {}]]], "class_name": "LSTM", "config": {"trainable": true, "activity_regularizer": null, "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}, "units": 256, "recurrent_constraint": null, "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "return_state": true, "bias_regularizer": null, "dropout": 0.0, "kernel_constraint": null, "recurrent_activation": "hard_sigmoid", "recurrent_regularizer": null, "use_bias": true, "stateful": false, "go_backwards": false, "bias_constraint": null, "unit_forget_bias": true, "recurrent_dropout": 0.0, "implementation": 1, "unroll": false, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "return_sequences": false, "name": "encoder_lstm", "activation": "tanh", "kernel_regularizer": null}, "name": "encoder_lstm"}, {"inbound_nodes": [[["decoder_inputs", 0, 0, {}], ["encoder_lstm", 0, 1, {}], ["encoder_lstm", 0, 2, {}]]], "class_name": "LSTM", "config": {"trainable": true, "activity_regularizer": null, "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}, "units": 256, "recurrent_constraint": null, "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "return_state": true, "bias_regularizer": null, "dropout": 0.0, "kernel_constraint": null, "recurrent_activation": "hard_sigmoid", "recurrent_regularizer": null, "use_bias": true, "stateful": false, "go_backwards": false, "bias_constraint": null, "unit_forget_bias": true, "recurrent_dropout": 0.0, "implementation": 1, "unroll": false, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "return_sequences": true, "name": "decoder_lstm", "activation": "tanh", "kernel_regularizer": null}, "name": "decoder_lstm"}, {"inbound_nodes": [[["decoder_lstm", 0, 0, {}]]], "class_name": "Dense", "config": {"trainable": true, "activity_regularizer": null, "bias_constraint": null, "units": 45, "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "use_bias": true, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "name": "decoder_dense", "activation": "softmax", "kernel_regularizer": null}, "name": "decoder_dense"}]}, "backend": "tensorflow", "keras_version": "2.1.3", "class_name": "Model"}