{"keras_version": "2.1.3", "backend": "tensorflow", "config": {"layers": [{"class_name": "InputLayer", "name": "encoder_inputs", "config": {"batch_input_shape": [null, null], "dtype": "float32", "name": "encoder_inputs", "sparse": false}, "inbound_nodes": []}, {"class_name": "Embedding", "name": "encoder_embedding", "config": {"embeddings_initializer": {"config": {"seed": null, "minval": -0.05, "maxval": 0.05}, "class_name": "RandomUniform"}, "embeddings_constraint": null, "dtype": "float32", "input_length": 40, "mask_zero": false, "activity_regularizer": null, "embeddings_regularizer": null, "input_dim": 2973, "batch_input_shape": [null, 40], "name": "encoder_embedding", "output_dim": 256, "trainable": true}, "inbound_nodes": [[["encoder_inputs", 0, 0, {}]]]}, {"class_name": "InputLayer", "name": "decoder_inputs", "config": {"batch_input_shape": [null, null, 2689], "dtype": "float32", "name": "decoder_inputs", "sparse": false}, "inbound_nodes": []}, {"class_name": "LSTM", "name": "encoder_lstm", "config": {"recurrent_constraint": null, "recurrent_regularizer": null, "unroll": false, "recurrent_dropout": 0.0, "implementation": 1, "use_bias": true, "name": "encoder_lstm", "unit_forget_bias": true, "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "dropout": 0.0, "activation": "tanh", "stateful": false, "kernel_constraint": null, "activity_regularizer": null, "go_backwards": false, "recurrent_activation": "hard_sigmoid", "kernel_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "return_state": true, "bias_constraint": null, "units": 256, "return_sequences": false, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}}, "inbound_nodes": [[["encoder_embedding", 0, 0, {}]]]}, {"class_name": "LSTM", "name": "decoder_lstm", "config": {"recurrent_constraint": null, "recurrent_regularizer": null, "unroll": false, "recurrent_dropout": 0.0, "implementation": 1, "use_bias": true, "name": "decoder_lstm", "unit_forget_bias": true, "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "dropout": 0.0, "activation": "tanh", "stateful": false, "kernel_constraint": null, "activity_regularizer": null, "go_backwards": false, "recurrent_activation": "hard_sigmoid", "kernel_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "return_state": true, "bias_constraint": null, "units": 256, "return_sequences": true, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}}, "inbound_nodes": [[["decoder_inputs", 0, 0, {}], ["encoder_lstm", 0, 1, {}], ["encoder_lstm", 0, 2, {}]]]}, {"class_name": "Dense", "name": "decoder_dense", "config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "activation": "softmax", "kernel_constraint": null, "units": 2689, "activity_regularizer": null, "kernel_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "use_bias": true, "name": "decoder_dense", "bias_constraint": null, "trainable": true}, "inbound_nodes": [[["decoder_lstm", 0, 0, {}]]]}], "name": "model_1", "output_layers": [["decoder_dense", 0, 0]], "input_layers": [["encoder_inputs", 0, 0], ["decoder_inputs", 0, 0]]}, "class_name": "Model"}